tests/Chisel.Tests/DependencyGraphTest.SqlClientGraph_graphviz.verified.gv
# Generated by https://github.com/0xced/Chisel

digraph
{
  rankdir=LR
  node [ fontname = "Segoe UI, sans-serif", shape = box, style = filled, color = aquamarine ]

  "Azure.Core/1.35.0" -> "Microsoft.Bcl.AsyncInterfaces/1.1.1"
  "Azure.Core/1.35.0" -> "System.Diagnostics.DiagnosticSource/6.0.1"
  "Azure.Core/1.35.0" -> "System.Memory.Data/1.0.2"
  "Azure.Core/1.35.0" -> "System.Text.Encodings.Web/4.7.2"
  "Azure.Core/1.35.0" -> "System.Text.Json/4.7.2"
  "Azure.Identity/1.10.3" -> "Azure.Core/1.35.0"
  "Azure.Identity/1.10.3" -> "Microsoft.Identity.Client.Extensions.Msal/4.56.0"
  "Azure.Identity/1.10.3" -> "Microsoft.Identity.Client/4.56.0"
  "Azure.Identity/1.10.3" -> "System.Security.Cryptography.ProtectedData/8.0.0"
  "Azure.Identity/1.10.3" -> "System.Text.Json/4.7.2"
  "Microsoft.Data.SqlClient/5.2.0" -> "Azure.Identity/1.10.3"
  "Microsoft.Data.SqlClient/5.2.0" -> "Microsoft.Data.SqlClient.SNI.runtime/5.2.0"
  "Microsoft.Data.SqlClient/5.2.0" -> "Microsoft.Identity.Client/4.56.0"
  "Microsoft.Data.SqlClient/5.2.0" -> "Microsoft.IdentityModel.JsonWebTokens/6.35.0"
  "Microsoft.Data.SqlClient/5.2.0" -> "Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0"
  "Microsoft.Data.SqlClient/5.2.0" -> "Microsoft.SqlServer.Server/1.0.0"
  "Microsoft.Data.SqlClient/5.2.0" -> "System.Configuration.ConfigurationManager/8.0.0"
  "Microsoft.Data.SqlClient/5.2.0" -> "System.Runtime.Caching/8.0.0"
  "Microsoft.Identity.Client.Extensions.Msal/4.56.0" -> "Microsoft.Identity.Client/4.56.0"
  "Microsoft.Identity.Client.Extensions.Msal/4.56.0" -> "System.IO.FileSystem.AccessControl/5.0.0"
  "Microsoft.Identity.Client.Extensions.Msal/4.56.0" -> "System.Security.Cryptography.ProtectedData/8.0.0"
  "Microsoft.IdentityModel.JsonWebTokens/6.35.0" -> "Microsoft.IdentityModel.Tokens/6.35.0"
  "Microsoft.IdentityModel.JsonWebTokens/6.35.0" -> "System.Text.Encodings.Web/4.7.2"
  "Microsoft.IdentityModel.JsonWebTokens/6.35.0" -> "System.Text.Json/4.7.2"
  "Microsoft.IdentityModel.Logging/6.35.0" -> "Microsoft.IdentityModel.Abstractions/6.35.0"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0" -> "Microsoft.IdentityModel.Protocols/6.35.0"
  "Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0" -> "System.IdentityModel.Tokens.Jwt/6.35.0"
  "Microsoft.IdentityModel.Protocols/6.35.0" -> "Microsoft.IdentityModel.Logging/6.35.0"
  "Microsoft.IdentityModel.Protocols/6.35.0" -> "Microsoft.IdentityModel.Tokens/6.35.0"
  "Microsoft.IdentityModel.Tokens/6.35.0" -> "Microsoft.IdentityModel.Logging/6.35.0"
  "Microsoft.IdentityModel.Tokens/6.35.0" -> "System.Security.Cryptography.Cng/4.5.0"
  "System.Configuration.ConfigurationManager/8.0.0" -> "System.Diagnostics.EventLog/8.0.0"
  "System.Configuration.ConfigurationManager/8.0.0" -> "System.Security.Cryptography.ProtectedData/8.0.0"
  "System.Diagnostics.DiagnosticSource/6.0.1" -> "System.Runtime.CompilerServices.Unsafe/6.0.0"
  "System.IdentityModel.Tokens.Jwt/6.35.0" -> "Microsoft.IdentityModel.JsonWebTokens/6.35.0"
  "System.IdentityModel.Tokens.Jwt/6.35.0" -> "Microsoft.IdentityModel.Tokens/6.35.0"
  "System.IO.FileSystem.AccessControl/5.0.0" -> "System.Security.AccessControl/5.0.0"
  "System.IO.FileSystem.AccessControl/5.0.0" -> "System.Security.Principal.Windows/5.0.0"
  "System.Memory.Data/1.0.2" -> "System.Text.Encodings.Web/4.7.2"
  "System.Memory.Data/1.0.2" -> "System.Text.Json/4.7.2"
  "System.Runtime.Caching/8.0.0" -> "System.Configuration.ConfigurationManager/8.0.0"
  "System.Security.AccessControl/5.0.0" -> "System.Security.Principal.Windows/5.0.0"

  "Azure.Core/1.35.0" [ color = lightcoral ]
  "Azure.Identity/1.10.3" [ color = lightcoral ]
  "Microsoft.Bcl.AsyncInterfaces/1.1.1" [ color = lightcoral ]
  "Microsoft.Data.SqlClient.SNI.runtime/5.2.0"
  "Microsoft.Data.SqlClient/5.2.0"
  "Microsoft.Identity.Client.Extensions.Msal/4.56.0" [ color = lightcoral ]
  "Microsoft.Identity.Client/4.56.0" [ color = skyblue ]
  "Microsoft.IdentityModel.Abstractions/6.35.0" [ color = lightcoral ]
  "Microsoft.IdentityModel.JsonWebTokens/6.35.0" [ color = lightcoral ]
  "Microsoft.IdentityModel.Logging/6.35.0" [ color = lightcoral ]
  "Microsoft.IdentityModel.Protocols.OpenIdConnect/6.35.0" [ color = lightcoral ]
  "Microsoft.IdentityModel.Protocols/6.35.0" [ color = lightcoral ]
  "Microsoft.IdentityModel.Tokens/6.35.0" [ color = lightcoral ]
  "Microsoft.SqlServer.Server/1.0.0"
  "System.Configuration.ConfigurationManager/8.0.0"
  "System.Diagnostics.DiagnosticSource/6.0.1" [ color = lightcoral ]
  "System.Diagnostics.EventLog/8.0.0"
  "System.IdentityModel.Tokens.Jwt/6.35.0" [ color = lightcoral ]
  "System.IO.FileSystem.AccessControl/5.0.0" [ color = lightcoral ]
  "System.Memory.Data/1.0.2" [ color = lightcoral ]
  "System.Runtime.Caching/8.0.0"
  "System.Runtime.CompilerServices.Unsafe/6.0.0" [ color = lightcoral ]
  "System.Security.AccessControl/5.0.0" [ color = lightcoral ]
  "System.Security.Cryptography.Cng/4.5.0" [ color = lightcoral ]
  "System.Security.Cryptography.ProtectedData/8.0.0"
  "System.Security.Principal.Windows/5.0.0" [ color = lightcoral ]
  "System.Text.Encodings.Web/4.7.2" [ color = lightcoral ]
  "System.Text.Json/4.7.2" [ color = lightcoral ]
}
